wsd_resolve-response.xml

<?xml version='1.0' ?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsdisco="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:wsdp="http://schemas.xmlsoap.org/ws/2006/02/devprof" xmlns:wprt="http://schemas.microsoft.com/windows/2006/08/wdp/print" xmlns:wscn="http://schemas.microsoft.com/windows/2006/08/wdp/scan">
	<soap:Header>
		<wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ResolveMatches</wsa:Action>
		<wsa:MessageID>urn:uuid:c34c5c20-1eb5-11b2-a11b-f4813944662e</wsa:MessageID>
		<wsa:RelatesTo>urn:uuid:f4d6720a-d248-4366-b6e6-2df030f8cffa</wsa:RelatesTo>
		<wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
		<wsdisco:AppSequence InstanceId="66" MessageNumber="38"/>
	</soap:Header>
	<soap:Body>
		<wsdisco:ResolveMatches>
			<wsdisco:ResolveMatch>
				<wsa:EndpointReference>
					<wsa:Address>urn:uuid:00000000-0000-1000-8000-f4813944662e</wsa:Address>
				</wsa:EndpointReference>
				<wsdisco:Types>wsdp:Device wprt:PrintDeviceType wscn:ScanDeviceType</wsdisco:Types>
				<wsdisco:XAddrs>http://192.168.1.5:80/wsd/pnpx-metadata.cgi</wsdisco:XAddrs>
				<wsdisco:MetadataVersion>1</wsdisco:MetadataVersion>
			</wsdisco:ResolveMatch>
		</wsdisco:ResolveMatches>
	</soap:Body>
</soap:Envelope>
